In [1]:
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func, MetaData

In [11]:
engine = create_engine("sqlite:///my_data.db", echo=True)

In [12]:
m = MetaData()

In [13]:
base = automap_base(bind=engine, metadata=m)
base.prepare(engine, reflect=True)

2023-06-05 16:11:36,146 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2023-06-05 16:11:36,147 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,150 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("data_salaries")
2023-06-05 16:11:36,151 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,156 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-05 16:11:36,157 INFO sqlalchemy.engine.Engine [raw sql] ('data_salaries',)
2023-06-05 16:11:36,160 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("data_salaries")
2023-06-05 16:11:36,162 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,164 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("data_salaries")
2023-06-05 16:11:36,166 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,169 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-05 16:11:36,170 INFO sqlalchemy.engine.Engine [raw sql] ('data_salaries',)
2023-06-05 16:11:36,170 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("data_salaries")
2023-06-05 16:11:36,170 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,178 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("data_salaries")
2023-06-05 16:11:36,180 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,181 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("data_salaries")
2023-06-05 16:11:36,182 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,185 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("data_salaries")
2023-06-05 16:11:36,185 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,185 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-05 16:11:36,185 INFO sqlalchemy.engine.Engine [raw sql] ('data_salaries',)
2023-06-05 16:11:36,193 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("data_science")
2023-06-05 16:11:36,194 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,197 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-05 16:11:36,198 INFO sqlalchemy.engine.Engine [raw sql] ('data_science',)
2023-06-05 16:11:36,200 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("data_science")
2023-06-05 16:11:36,202 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,203 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("data_science")
2023-06-05 16:11:36,204 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,206 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-05 16:11:36,207 INFO sqlalchemy.engine.Engine [raw sql] ('data_science',)
2023-06-05 16:11:36,209 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("data_science")
2023-06-05 16:11:36,210 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,210 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("data_science")
2023-06-05 16:11:36,210 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,210 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("sqlite_autoindex_data_science_1")
2023-06-05 16:11:36,210 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-05 16:11:36,210 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-05 16:11:36,210 INFO sqlalchemy.engine.Engine [raw sql] ('data_science',)

In [14]:
base.classes.keys()

['data_science']

In [104]:
session = Session(engine)

In [106]:
Data_Science = Base.classes.data_science

In [109]:
session.query(Data_Science.work_year).first()[0]

2023-06-02 13:22:37,318 INFO sqlalchemy.engine.Engine SELECT data_science.work_year AS data_science_work_year
FROM data_science
 LIMIT %(param_1)s
2023-06-02 13:22:37,320 INFO sqlalchemy.engine.Engine [cached since 17.09s ago] {'param_1': 1}

2023

In [36]:
import sqlite3

conn = sqlite3.connect("my_data.db")
c = conn.cursor()

In [38]:
data = c.execute("SELECT * FROM data_salaries").fetchall()

In [41]:
import pandas as pd

df = pd.read_sql("SELECT * FROM data_salaries", conn)

In [42]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M